In [1]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

%precision 3

'%.3f'

In [2]:
# p.165-166
hier_df = pd.DataFrame(np.arange(9).reshape(3, 3),
                       index = [
                                ['a','a', 'b'],
                                [1  , 2 , 2 ]
                                ],
                       columns = [
                                  ['Pusan', 'Seoul', 'Pusan'],
                                  ['Blue', 'Red', 'Red']
                                  ]
                       )

hier_df

    Pusan Seoul Pusan
     Blue   Red   Red
a 1     0     1     2
  2     3     4     5
b 2     6     7     8

In [3]:
# p.166

hier_df.index.names = ['key1', 'key2']
hier_df.columns.names = ['city', 'color']

hier_df

city      Pusan Seoul Pusan
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

In [4]:
# p.166

hier_df['Pusan']

color      Blue  Red
key1 key2
a    1        0    2
     2        3    5
b    2        6    8

In [5]:
# p.167

hier_df.sum(level = 'key2', axis = 0)

city  Pusan Seoul Pusan
color  Blue   Red   Red
key2
1         0     1     2
2         9    11    13

In [6]:
# p.167

hier_df.sum(level = 'color', axis = 1)

color      Blue  Red
key1 key2
a    1        0    3
     2        3    9
b    2        6   15

In [7]:
# p.167

hier_df.drop(['b'])

city      Pusan Seoul Pusan
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

In [8]:
# p.167-168 Practice INPUT


hier_df1 = pd.DataFrame(
    np.arange(12).reshape((3, 4)),
    index = [['c', 'd', 'd'],[1,2,1]],
    columns = [['Daegu', 'Dajeon', 'Gangneung', 'Daegu'],
              ['Yellow', 'Yellow', 'Red', 'Blue']]
)

hier_df1.index.names = ['key1', 'key2']
hier_df1.columns.names = ['city', 'color']

hier_df1

city       Daegu Dajeon Gangneung Daegu
color     Yellow Yellow       Red  Blue
key1 key2
c    1         0      1         2     3
d    2         4      5         6     7
     1         8      9        10    11

In [9]:
# p.167-168 Practice 6-1

hier_df1['Daegu']

color      Yellow  Blue
key1 key2
c    1          0     3
d    2          4     7
     1          8    11

In [10]:
# p.167-168 Practice 6-2

hier_df1.mean(level = 'city', axis = 1)

city       Daegu  Dajeon  Gangneung
key1 key2
c    1       1.5     1.0        2.0
d    2       5.5     5.0        6.0
     1       9.5     9.0       10.0

In [11]:
# p.167-168 Practice 6-3

hier_df1.sum(level = 'key2', axis = 0)

city   Daegu Dajeon Gangneung Daegu
color Yellow Yellow       Red  Blue
key2
1          8     10        12    14
2          4      5         6     7

In [12]:
# p.168

data1 = {
    'id'         : ['100',      '101',      '102',      '103',      '104',      '106',      '108',      '110',      '111',      '113'],
    'city'       : ['Seoul',    'Pusan',    'Daegu',    'Gangneung','Seoul',    'Seoul',    'Pusan',    'Daegu',    'Gangneung','Seoul'],
    'birth_year' : [1990,       1989,       1992,       1997,       1982,       1991,       1988,       1990,       1995,       1981],
    'name'       : ['JH',       'HJ',       'MJ',       'MH',       'ST',       'MN',       'SU',       'MS',       'JH',       'DH']
    }
df1 = pd.DataFrame(data1)

df1

    id       city  birth_year name
0  100      Seoul        1990   JH
1  101      Pusan        1989   HJ
2  102      Daegu        1992   MJ
3  103  Gangneung        1997   MH
4  104      Seoul        1982   ST
5  106      Seoul        1991   MN
6  108      Pusan        1988   SU
7  110      Daegu        1990   MS
8  111  Gangneung        1995   JH
9  113      Seoul        1981   DH

In [13]:
# p.169

data2 = {
    'id'       : ['100',        '101',      '102',      '105',      '107'],
    'math'     : [50,           43,         33,         76,         98],
    'english'  : [90,           30,         20,         50,         30],
    'sex'      : ['M',          'F',        'F',        'M',        'M'],
    'index_num': [0,            1,          2,          3,          4]
         }

df2= pd.DataFrame(data2)

df2

    id  math  english sex  index_num
0  100    50       90   M          0
1  101    43       30   F          1
2  102    33       20   F          2
3  105    76       50   M          3
4  107    98       30   M          4

In [14]:
# p.170

print("inner join")
pd.merge(df1, df2, on='id')

inner join

    id   city  birth_year name  math  english sex  index_num
0  100  Seoul        1990   JH    50       90   M          0
1  101  Pusan        1989   HJ    43       30   F          1
2  102  Daegu        1992   MJ    33       20   F          2

In [15]:
df1.merge(df2, on = 'id') # 얘도 디폴트 inner join인가?

    id   city  birth_year name  math  english sex  index_num
0  100  Seoul        1990   JH    50       90   M          0
1  101  Pusan        1989   HJ    43       30   F          1
2  102  Daegu        1992   MJ    33       20   F          2

In [16]:
# p.171

print("outer join")
pd.merge(df1, df2, how = 'outer')

outer join

     id       city  birth_year name  math  english  sex  index_num
0   100      Seoul      1990.0   JH  50.0     90.0    M        0.0
1   101      Pusan      1989.0   HJ  43.0     30.0    F        1.0
2   102      Daegu      1992.0   MJ  33.0     20.0    F        2.0
3   103  Gangneung      1997.0   MH   NaN      NaN  NaN        NaN
4   104      Seoul      1982.0   ST   NaN      NaN  NaN        NaN
5   106      Seoul      1991.0   MN   NaN      NaN  NaN        NaN
6   108      Pusan      1988.0   SU   NaN      NaN  NaN        NaN
7   110      Daegu      1990.0   MS   NaN      NaN  NaN        NaN
8   111  Gangneung      1995.0   JH   NaN      NaN  NaN        NaN
9   113      Seoul      1981.0   DH   NaN      NaN  NaN        NaN
10  105        NaN         NaN  NaN  76.0     50.0    M        3.0
11  107        NaN         NaN  NaN  98.0     30.0    M        4.0

In [17]:
df1.merge(df2, how = 'outer') # 이렇게 해도 how 잘 지정하면 outer join

     id       city  birth_year name  math  english  sex  index_num
0   100      Seoul      1990.0   JH  50.0     90.0    M        0.0
1   101      Pusan      1989.0   HJ  43.0     30.0    F        1.0
2   102      Daegu      1992.0   MJ  33.0     20.0    F        2.0
3   103  Gangneung      1997.0   MH   NaN      NaN  NaN        NaN
4   104      Seoul      1982.0   ST   NaN      NaN  NaN        NaN
5   106      Seoul      1991.0   MN   NaN      NaN  NaN        NaN
6   108      Pusan      1988.0   SU   NaN      NaN  NaN        NaN
7   110      Daegu      1990.0   MS   NaN      NaN  NaN        NaN
8   111  Gangneung      1995.0   JH   NaN      NaN  NaN        NaN
9   113      Seoul      1981.0   DH   NaN      NaN  NaN        NaN
10  105        NaN         NaN  NaN  76.0     50.0    M        3.0
11  107        NaN         NaN  NaN  98.0     30.0    M        4.0

In [18]:
# p.171

print("index 이용")
pd.merge(df1, df2, left_index=True, right_on='index_num')

index 이용

  id_x       city  birth_year name id_y  math  english sex  index_num
0  100      Seoul        1990   JH  100    50       90   M          0
1  101      Pusan        1989   HJ  101    43       30   F          1
2  102      Daegu        1992   MJ  102    33       20   F          2
3  103  Gangneung        1997   MH  105    76       50   M          3
4  104      Seoul        1982   ST  107    98       30   M          4

In [19]:
pd.merge(df1, df2, left_index=True, right_index=True) # 시도

  id_x       city  birth_year name id_y  math  english sex  index_num
0  100      Seoul        1990   JH  100    50       90   M          0
1  101      Pusan        1989   HJ  101    43       30   F          1
2  102      Daegu        1992   MJ  102    33       20   F          2
3  103  Gangneung        1997   MH  105    76       50   M          3
4  104      Seoul        1982   ST  107    98       30   M          4

In [20]:
pd.merge(df1, df2, left_on='id', right_index=True) # 시도

ValueError: ignored

* left_on : label or list, or array-like
    * Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays of the length of the left DataFrame. These arrays are treated as if they are columns.

* right_on : label or list, or array-like
    * Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays of the length of the right DataFrame. These arrays are treated as if they are columns

* left_index : bool, default False
    * Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys in the other DataFrame (either the index or a number of columns) must match the number of levels.
* right_index : bool, default False
    * Use the index from the right DataFrame as the join key. Same caveats as left_index.

In [21]:
# p.172

print("left join")
pd.merge(df1, df2, how = 'left')

left join

    id       city  birth_year name  math  english  sex  index_num
0  100      Seoul        1990   JH  50.0     90.0    M        0.0
1  101      Pusan        1989   HJ  43.0     30.0    F        1.0
2  102      Daegu        1992   MJ  33.0     20.0    F        2.0
3  103  Gangneung        1997   MH   NaN      NaN  NaN        NaN
4  104      Seoul        1982   ST   NaN      NaN  NaN        NaN
5  106      Seoul        1991   MN   NaN      NaN  NaN        NaN
6  108      Pusan        1988   SU   NaN      NaN  NaN        NaN
7  110      Daegu        1990   MS   NaN      NaN  NaN        NaN
8  111  Gangneung        1995   JH   NaN      NaN  NaN        NaN
9  113      Seoul        1981   DH   NaN      NaN  NaN        NaN

In [22]:
df1.merge(df2, how = 'left') # 동일

    id       city  birth_year name  math  english  sex  index_num
0  100      Seoul        1990   JH  50.0     90.0    M        0.0
1  101      Pusan        1989   HJ  43.0     30.0    F        1.0
2  102      Daegu        1992   MJ  33.0     20.0    F        2.0
3  103  Gangneung        1997   MH   NaN      NaN  NaN        NaN
4  104      Seoul        1982   ST   NaN      NaN  NaN        NaN
5  106      Seoul        1991   MN   NaN      NaN  NaN        NaN
6  108      Pusan        1988   SU   NaN      NaN  NaN        NaN
7  110      Daegu        1990   MS   NaN      NaN  NaN        NaN
8  111  Gangneung        1995   JH   NaN      NaN  NaN        NaN
9  113      Seoul        1981   DH   NaN      NaN  NaN        NaN

In [23]:
# p.172

data3 = {
    'id'         : ['117',      '118',      '119',      '120',      '125'],
    'city'       : ['Ilsan',    'Gunpo',    'Seoul',    'Changwon', 'Jeju'],
    'birth_year' : [1990,       1989,       1992,       1997,       1982],
    'name'       : ['JH',       'YH',       'JH',       'YH',       'HJ']
    }
df3 = pd.DataFrame(data3)

df3

    id      city  birth_year name
0  117     Ilsan        1990   JH
1  118     Gunpo        1989   YH
2  119     Seoul        1992   JH
3  120  Changwon        1997   YH
4  125      Jeju        1982   HJ

In [24]:
# p.172

print("concat 수직방향 결합")
concat_data = pd.concat([df1, df3])
concat_data

concat 수직방향 결합

    id       city  birth_year name
0  100      Seoul        1990   JH
1  101      Pusan        1989   HJ
2  102      Daegu        1992   MJ
3  103  Gangneung        1997   MH
4  104      Seoul        1982   ST
5  106      Seoul        1991   MN
6  108      Pusan        1988   SU
7  110      Daegu        1990   MS
8  111  Gangneung        1995   JH
9  113      Seoul        1981   DH
0  117      Ilsan        1990   JH
1  118      Gunpo        1989   YH
2  119      Seoul        1992   JH
3  120   Changwon        1997   YH
4  125       Jeju        1982   HJ

In [25]:
df1.concat(df3) # 시도. 안됨.

AttributeError: ignored

In [ ]:
# p.173 Practice 6-4

data4 = {
    'id'         : ['0',    '1',    '2',    '3',    '4',    '6',    '8',    '11',   '12',   '13'],
    'city'       : ['Se',   'Pu',   'Da',   'Ga',   'Se',   'Se',   'Pu',   'Da',   'Ga',   'Se'],
    'birth_year' : [1990,   1989,   1992,   1997,   1982,   1991,   1988,   1990,   1995,   1981],
    'name'       : ['JH',   'HJ',   'MJ',   'MH',   'ST',   'MN',   'SM',   'MS',   'JH',   'DH']
    }
df4 = pd.DataFrame(data4)
df4

In [ ]:
data5 = {
    'id'         : ['0',    '1',    '3',    '6',    '8'],
    'math'       : [20,     30,     50,     70,     90],
    'english'    : [30,     50,     50,     70,     20],
    'sex'        : ['M',    'F',    'F',    'M',    'M'],
    'index_num'  : [0,      1,      2,      3,      4] 
    }
df5 = pd.DataFrame(data5)
df5

In [26]:
pd.merge(df4, df5, how = 'inner')

NameError: ignored

In [ ]:
# p.173 Practice 6-5

df4.merge(df5, how = 'outer')

In [ ]:
# p.174 Practice 6-6

data6 = {
    'id'         : ['70',   '80',   '90',   '120',  '150'],
    'city'       : ['Il',   'Gu',   'Se',   'Ch',   'Je'],
    'birth_year' : [1980,   1999,   1995,   1994,   1994],
    'name'       : ['JH',   'YH',   'JH',   'YH',   'HJ']
    }
df6 = pd.DataFrame(data6)
df6

In [ ]:
pd.concat([df4, df6])

In [27]:
# p.175

hier_df = pd.DataFrame(np.arange(9).reshape((3, 3)),
                       index = [
                                ['a', 'a', 'b'],
                                [1, 2, 2]
                       ],
                       columns = [
                                  ['Pu', 'Se', 'Pu'],
                                  ['Blue', 'Red', 'Red']
                       ]
                       )
hier_df

      Pu  Se  Pu
    Blue Red Red
a 1    0   1   2
  2    3   4   5
b 2    6   7   8

In [28]:
hier_df.stack()

          Pu   Se
a 1 Blue   0  NaN
    Red    2  1.0
  2 Blue   3  NaN
    Red    5  4.0
b 2 Blue   6  NaN
    Red    8  7.0

In [29]:
hier_df.stack().stack()

a  1  Blue  Pu    0.0
      Red   Pu    2.0
            Se    1.0
   2  Blue  Pu    3.0
      Red   Pu    5.0
            Se    4.0
b  2  Blue  Pu    6.0
      Red   Pu    8.0
            Se    7.0
dtype: float64

In [30]:
hier_df.stack().stack().unstack()

           Pu   Se
a 1 Blue  0.0  NaN
    Red   2.0  1.0
  2 Blue  3.0  NaN
    Red   5.0  4.0
b 2 Blue  6.0  NaN
    Red   8.0  7.0

In [31]:
hier_df.stack().stack().unstack().unstack()

      Pu        Se
    Blue  Red Blue  Red
a 1  0.0  2.0  NaN  1.0
  2  3.0  5.0  NaN  4.0
b 2  6.0  8.0  NaN  7.0

In [32]:
hier_df.stack().stack().unstack().unstack().unstack()

    Pu                  Se
  Blue       Red      Blue      Red
     1    2    1    2    1   2    1    2
a  0.0  3.0  2.0  5.0  NaN NaN  1.0  4.0
b  NaN  6.0  NaN  8.0  NaN NaN  NaN  7.0

In [33]:
hier_df.stack().stack().unstack().unstack().unstack().unstack()

Pu  Blue  1  a    0.0
             b    NaN
          2  a    3.0
             b    6.0
    Red   1  a    2.0
             b    NaN
          2  a    5.0
             b    8.0
Se  Blue  1  a    NaN
             b    NaN
          2  a    NaN
             b    NaN
    Red   1  a    1.0
             b    NaN
          2  a    4.0
             b    7.0
dtype: float64

In [34]:
# p.176

dupli_data = pd.DataFrame({
    'col1': [1,1,2,3,4,4,6,6],
    'col2': ['a', 'b','b','b','c','c','b','b',]
})

dupli_data

   col1 col2
0     1    a
1     1    b
2     2    b
3     3    b
4     4    c
5     4    c
6     6    b
7     6    b

In [35]:
dupli_data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [36]:
dupli_data.duplicated(keep = 'last')

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7    False
dtype: bool

In [37]:
dupli_data.duplicated(keep = False)

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
dtype: bool

In [38]:
dupli_data.drop_duplicates()

   col1 col2
0     1    a
1     1    b
2     2    b
3     3    b
4     4    c
6     6    b

In [39]:
# p.177

city_map = {
    'Seoul': 'Sudo',
    'Gangneung' : 'Yeongdong',
    'Pusan' : 'Yeongnam',
    'Daegu' : 'Yeongnam'
}

df1['region'] = df1['city'].map(city_map)
df1

    id       city  birth_year name     region
0  100      Seoul        1990   JH       Sudo
1  101      Pusan        1989   HJ   Yeongnam
2  102      Daegu        1992   MJ   Yeongnam
3  103  Gangneung        1997   MH  Yeongdong
4  104      Seoul        1982   ST       Sudo
5  106      Seoul        1991   MN       Sudo
6  108      Pusan        1988   SU   Yeongnam
7  110      Daegu        1990   MS   Yeongnam
8  111  Gangneung        1995   JH  Yeongdong
9  113      Seoul        1981   DH       Sudo

In [40]:
# p.178 익명함수와 map 함수 조합

df1['up_two_num'] = df1['birth_year'].map(lambda x: str(x)[0:3])
df1['up_two_num1'] = df1['birth_year'].apply(lambda x: str(x)[0:3]) # 동일
df1

    id       city  birth_year name     region up_two_num up_two_num1
0  100      Seoul        1990   JH       Sudo        199         199
1  101      Pusan        1989   HJ   Yeongnam        198         198
2  102      Daegu        1992   MJ   Yeongnam        199         199
3  103  Gangneung        1997   MH  Yeongdong        199         199
4  104      Seoul        1982   ST       Sudo        198         198
5  106      Seoul        1991   MN       Sudo        199         199
6  108      Pusan        1988   SU   Yeongnam        198         198
7  110      Daegu        1990   MS   Yeongnam        199         199
8  111  Gangneung        1995   JH  Yeongdong        199         199
9  113      Seoul        1981   DH       Sudo        198         198

In [41]:
# p.178 구간화

birth_year_bins = [1980, 1985, 1990, 1995, 2000]

birth_year_cut_data = pd.cut(df1.birth_year, birth_year_bins)
pd.value_counts(birth_year_cut_data)

(1985, 1990]    4
(1990, 1995]    3
(1980, 1985]    2
(1995, 2000]    1
Name: birth_year, dtype: int64

In [42]:
group_names = ['early1980s', 'late19080s', 'early1990s', 'late19090s']
birth_year_cut_data = pd.cut(df1.birth_year, birth_year_bins, labels = group_names)
pd.value_counts(birth_year_cut_data)

late19080s    4
early1990s    3
early1980s    2
late19090s    1
Name: birth_year, dtype: int64

In [43]:
birth_year_cut_data = pd.cut(df1.birth_year, 2)
pd.value_counts(birth_year_cut_data)

(1989.0, 1997.0]      6
(1980.984, 1989.0]    4
Name: birth_year, dtype: int64

In [44]:
birth_year_cut_data = pd.qcut(df1.birth_year, 2)
pd.value_counts(birth_year_cut_data)

(1980.999, 1990.0]    6
(1990.0, 1997.0]      4
Name: birth_year, dtype: int64

In [45]:
# p.180 Practice 6-7
import requests, zipfile
from io import StringIO
import io

url = 'http://archive.ics.uci.edu/ml/machine-learning-databases/00356/student.zip'
r = requests.get(url, stream=True)
z = zipfile.ZipFile(io.BytesIO(r.content))
z.extractall()

student_data_math = pd.read_csv('student-mat.csv', sep = ';')
student_data_math.head()

  school sex  age address famsize Pstatus  ...  Walc  health absences  G1  G2  G3
0     GP   F   18       U     GT3       A  ...     1       3        6   5   6   6
1     GP   F   17       U     GT3       T  ...     1       3        4   5   5   6
2     GP   F   15       U     LE3       T  ...     3       3       10   7   8  10
3     GP   F   15       U     GT3       T  ...     1       5        2  15  14  15
4     GP   F   16       U     GT3       T  ...     2       5        4   6  10  10

[5 rows x 33 columns]

In [46]:
student_data_math['new_column'] = student_data_math['age'].map(lambda x: x*2)
student_data_math[['age', 'new_column']].head()

   age  new_column
0   18          36
1   17          34
2   15          30
3   15          30
4   16          32

In [47]:
# p.180-181 Practice 6-8

bins = [0, 1, 5, 100]
pd.value_counts(pd.cut(student_data_math.absences, bins, right = False ))

[5, 100)    151
[1, 5)      129
[0, 1)      115
Name: absences, dtype: int64

In [48]:
# p.180-181 Practice 6-9

pd.value_counts(pd.qcut(student_data_math.absences, 3))

(-0.001, 2.0]    183
(6.0, 75.0]      115
(2.0, 6.0]        97
Name: absences, dtype: int64

In [50]:
# p.181
df1.groupby('city').size()

city
Daegu        2
Gangneung    2
Pusan        2
Seoul        4
dtype: int64

In [51]:
df1.groupby('city')['birth_year'].mean()

city
Daegu        1991.0
Gangneung    1996.0
Pusan        1988.5
Seoul        1986.0
Name: birth_year, dtype: float64

In [52]:
df1.groupby(['region','city'])['birth_year'].mean()

region     city
Sudo       Seoul        1986.0
Yeongdong  Gangneung    1996.0
Yeongnam   Daegu        1991.0
           Pusan        1988.5
Name: birth_year, dtype: float64

In [53]:
df1.groupby(['region','city'], as_index = False)['birth_year'].mean()

      region       city  birth_year
0       Sudo      Seoul      1986.0
1  Yeongdong  Gangneung      1996.0
2   Yeongnam      Daegu      1991.0
3   Yeongnam      Pusan      1988.5

In [59]:
# p.183

for group, subdf in df1.groupby('region'):
    print("====================================================================")
    print('Region name: {0}'.format(group))
    print(subdf)

====================================================================
Region name: Sudo
    id   city  birth_year name region up_two_num up_two_num1
0  100  Seoul        1990   JH   Sudo        199         199
4  104  Seoul        1982   ST   Sudo        198         198
5  106  Seoul        1991   MN   Sudo        199         199
9  113  Seoul        1981   DH   Sudo        198         198
====================================================================
Region name: Yeongdong
    id       city  birth_year name     region up_two_num up_two_num1
3  103  Gangneung        1997   MH  Yeongdong        199         199
8  111  Gangneung        1995   JH  Yeongdong        199         199
====================================================================
Region name: Yeongnam
    id   city  birth_year name    region up_two_num up_two_num1
1  101  Pusan        1989   HJ  Yeongnam        198         198
2  102  Daegu        1992   MJ  Yeongnam        199         199
6  108  Pusan        1988   SU  Yeongnam        198         198
7  110  Daegu        1990   MS  Yeongnam        199         199

In [62]:
# p.183

functions = ['count', 'mean', 'max', 'min']
grouped_student_data1 = student_data_math.groupby(['sex', 'address'])
grouped_student_data1['age', 'G1'].agg(functions)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """

              age                       G1
            count       mean max min count       mean max min
sex address
F   R          44  16.977273  19  15    44  10.295455  19   6
    U         164  16.664634  20  15   164  10.707317  18   4
M   R          44  17.113636  21  15    44  10.659091  18   3
    U         143  16.517483  22  15   143  11.405594  19   5

In [70]:
# p.184 Practice 6-10

student_data_math.groupby('school')['G1'].mean()

school
GP    10.939828
MS    10.673913
Name: G1, dtype: float64

In [71]:
# p.184 Practice 6-11

student_data_math.groupby(['school', 'sex'])['G1', 'G2', 'G3'].mean()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  This is separate from the ipykernel package so we can avoid doing imports until

                   G1         G2         G3
school sex
GP     F    10.579235  10.398907   9.972678
       M    11.337349  11.204819  11.060241
MS     F    10.920000  10.320000   9.920000
       M    10.380952  10.047619   9.761905

In [72]:
# p.184 Practice 6-12

student_data_math.groupby(['school', 'sex'])['G1', 'G2', 'G3'].agg(['max', 'min'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  This is separate from the ipykernel package so we can avoid doing imports until

            G1      G2      G3
           max min max min max min
school sex
GP     F    18   4  18   0  19   0
       M    19   3  19   0  20   0
MS     F    19   6  18   5  19   0
       M    15   6  16   5  16   0

In [73]:
# p.185

df = pd.DataFrame(np.random.rand(10, 4))

df.iloc[1, 0] = np.nan
df.iloc[2:3, 2] = np.nan
df.iloc[5:, 3] = np.nan

df

          0         1         2         3
0  0.681131  0.237638  0.491358  0.607487
1       NaN  0.709278  0.112121  0.951076
2  0.455456  0.563455       NaN  0.075828
3  0.484030  0.754058  0.693945  0.903865
4  0.241870  0.171256  0.323748  0.787653
5  0.356059  0.701692  0.692332       NaN
6  0.184313  0.055077  0.729336       NaN
7  0.434684  0.677768  0.312272       NaN
8  0.782502  0.907718  0.944128       NaN
9  0.562451  0.591323  0.032803       NaN